package com.example.demo;

public class FunctionalToAdd {
    //Тут буде описано що саме портіно додати до проекту і що скоротити

    //Після або під час форомування системи потрібно буде додати тести.

    //частина з перевіркою а саме база даних має впізнавати адміністратора
    //Адмвнвстартор не є користувач тому забрати логіку створенння пдміна у системі у наявній таблиці

    //Бажано додати окрему незалежну таблицю для роботи (все залежить від того як формуєтсья адмін)
    // Змінити формат бази даних під нові функції

    //Кори користувач авторизується ми в бд зберігаємо URL ориствува і його ід.
    // В подальшому ми пр опреаціях будемо отримувати id орисувача і саме собою його URL і потрібний запит.

    //  Перегялнути методи безпеки можливо деякі завдання вирішаться під час розробки

    //З додаткового функціоналу.

    //1. Сторінка користувача(неактивний до того часу поки користувач авторизується )
    //Додаток 1 системно заблокування перехід до системи поки користувач не авторизований

    //2. Детальниий перегляд квитка а саме місце відправлення ( користувач може переглянути детальніше квиток)
    //Додаток 2.1 Потрібно щось схоже на зехист від перевірки тих квитків які користувач не має
    //Пррорблема в тому що якщо ми надсилаємо просто ід квитка корисувач може надіслати штучний цим самим отримати будь які інйормації про квиток

    //Додаток 2.2 Додати функції видалення квитка на бекенді і додати відповідну кнопку на форнтенді.

    //3.(необоіязково)Зимінити вигляд прорами а додати як на смартфони як і на компютери



}